In [1]:
import pandas as pd

In [5]:
friend_dict_list = [{'name' : 'John', 'age': 15, 'job' : 'student'},
                    {'name' : 'Ben', 'age': 25, 'job' : 'developer'},
                    {'name' : 'Jenny', 'age': 30, 'job' : 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name','age', 'job'])

In [6]:
df.head()

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [7]:
df['salary'] = 0 #열삽입

In [8]:
df

    name  age        job  salary
0   John   15    student       0
1    Ben   25  developer       0
2  Jenny   30    teacher       0

In [9]:
import numpy as np

In [10]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
#샐러리열을 np로 표현하고싶은데, job에서 스튜던트가 아닌 애들은 yes, 그렇지 않으면 no라고 표현

In [11]:
df.head()

    name  age        job salary
0   John   15    student     no
1    Ben   25  developer    yes
2  Jenny   30    teacher    yes

In [28]:
friend_dict_list = [{'name' : 'John', 'midterm': 95, 'final' : 85},
                    {'name' : 'Ben', 'midterm': 85, 'final' : 75},
                    {'name' : 'Jenny', 'midterm': 30, 'final' : 10}]
df = pd.DataFrame(friend_dict_list, columns = ['name','midterm', 'final'])

In [29]:
df.head()

    name  midterm  final
0   John       95     85
1    Ben       85     75
2  Jenny       30     10

In [30]:
df['total'] = df['midterm'] + df['final'] #원하는 열을 추가하고, 합을 구할 수 있다

In [31]:
df.head()

    name  midterm  final  total
0   John       95     85    180
1    Ben       85     75    160
2  Jenny       30     10     40

In [32]:
df['average'] = df['total'] / 2

In [33]:
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1    Ben       85     75    160     80.0
2  Jenny       30     10     40     20.0

In [54]:
grades = [] #리스트(열)생성

for row in df['average']: #df내 열을 반복
    if row >= 90: #조건문 형성
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
        
df['grades'] = grades #새로운 열에 리스트 삽입

In [55]:
df.head()

    name  midterm  final  total  average grades grade
0   John       95     85    180     90.0      A  Pass
1    Ben       85     75    160     80.0      B  Pass
2  Jenny       30     10     40     20.0      F  Pass

In [56]:
def pass_or_fail(row): #함수
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [57]:
df.grade = df.grade.apply(pass_or_fail) #함수 적용(apply)

In [58]:
df.head()

    name  midterm  final  total  average grades grade
0   John       95     85    180     90.0      A  Pass
1    Ben       85     75    160     80.0      B  Pass
2  Jenny       30     10     40     20.0      F  Pass

In [61]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    },
]

df = pd.DataFrame(date_list, index = ['a', 'b'], columns = ['yyyy-mm-dd'])

In [62]:
df.head()

   yyyy-mm-dd
a  2000-06-27
b  2007-10-27

In [63]:
def extract_year(row): #추출함수 형성
    return row.split('-')[0] #-로 쪼개(split)겠다, 0번째 열을

In [65]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year) 
#year라는 새로운 열에, yyyy-mm-dd라는 열에서 extract_year함수를 적용시킨 열을 추가

In [66]:
df.head() #연도만 추출 가능

   yyyy-mm-dd  year
a  2000-06-27  2000
b  2007-10-27  2007

In [67]:
friend_dict_list = [{'name' : 'John', 'age': 15, 'job' : 'student'},
                    {'name' : 'Ben', 'age': 25, 'job' : 'developer'},
                    {'name' : 'Jenny', 'age': 30, 'job' : 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name','age', 'job'])

In [68]:
df.head()

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [69]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], index = ['c'], columns = ['name','midterm','final'])

In [70]:
df2.head()

  name  midterm  final
c  Ben       50     50

In [71]:
df.append(df2, ignore_index = True) #인덱스는 무시, 행추가

    name   age        job  midterm  final
0   John  15.0    student      NaN    NaN
1    Ben  25.0  developer      NaN    NaN
2  Jenny  30.0    teacher      NaN    NaN
3    Ben   NaN        NaN     50.0   50.0